# Brewfile
# Install with:
#   brew bundle --file=./Brewfile
#
# Notes:
# - `python` tracks the current Homebrew Python 3.
#   If you want a fixed minor version, replace with e.g. `python@3.13`.
# - `docker` (formula) installs the Docker CLI.
# - `docker-desktop` (cask) installs the Docker Desktop app.
# - Mac App Store apps are installed via `mas` in the brew script (not in this file).
#   `mas` requires you to be signed in to the Mac App Store.
# - `gcloud-cli` is a cask. If needed, add:
#     export PATH="$(brew --prefix)/share/google-cloud-sdk/bin:$PATH"

# Taps
tap "hashicorp/tap"

# Formulae
brew "awscli"
brew "chezmoi"
brew "curl"
brew "docker"
brew "docker-compose"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "mas"
brew "mysql"
brew "node"
brew "pnpm"
brew "python"
brew "sqlite"
brew "hashicorp/tap/terraform"
brew "tlrc"
brew "tree"
brew "uv"
brew "vim"
brew "webp"
brew "wget"

# Casks
# ── 비밀번호 다이얼로그가 뜨는 cask (helper tool / system extension 설치) ──
# 셋업 초반에 몰아 처리해서 그 뒤로는 unattended 진행되도록 맨 위 배치
cask "adguard"
cask "docker-desktop"
cask "karabiner-elements"
cask "logi-options+"

# ── 그 외 cask (대부분 unattended) ──
cask "alt-tab"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cmux"
cask "codex"
cask "codex-app"
cask "darktable"
cask "dbeaver-community"
cask "discord"
cask "eul"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "heynote"
cask "hidock"
cask "itsycal"
cask "keka"
cask "keyboardcleantool"
cask "monitorcontrol"
cask "obsidian"
cask "openinterminal-lite"
cask "raycast"
cask "rectangle"
cask "rustdesk"
cask "shottr"
cask "slack"
cask "visual-studio-code"
